{
  "main-appbar": {
    "title": "SciGateway",
    "contact": "Contact",
    "help": "Help",
    "admin": "Admin",
    "manage-cookies-button": "Manage cookies",
    "switch-light-mode": "Switch to light mode",
    "switch-dark-mode": "Switch to dark mode",
    "switch-high-contrast-off": "Switch high contrast mode off",
    "switch-high-contrast-on": "Switch high contrast mode on",
    "no-notifications": "No notifications",
    "open-navigation-menu": "Open navigation menu",
    "close-navigation-menu": "Close navigation menu",
    "admin-page": "Admin page",
    "help-page": "Help page",
    "open-browser-settings": "Open browser settings",
    "home-page": "Home page"
  },
  "login": {
    "title": "Sign in",
    "username-placeholder": "Username*",
    "password-placeholder": "Password*",
    "username-arialabel": "Input username",
    "password-arialabel": "Input password",
    "username-description": "Signed in as:",
    "login-button": "Sign in",
    "logout-button": "Sign out",
    "login-error-msg": "Failed to log in. Invalid username or password.",
    "logout-message": "Please log out to log in as another user",
    "login-redirect-error-msg": "Failed to log in. Re-direct token is invalid.",
    "token-invalid-msg": "Your session token has expired or been invalidated, please sign in again.",
    "forgotten-your-password": "Forgotten your password?",
    "forgotten-your-password-link": "https://users.facilities.rl.ac.uk/auth/ForgotPassword.aspx?",
    "need-help-signing-in": "Need help signing in?",
    "need-help-signing-in-link": "https://www.isis.stfc.ac.uk/Pages/Troubleshoot-Login.aspx",
    "dont-have-an-account-sign-up-now": "Don't have an account? <2>Sign up now</2>",
    "dont-have-an-account-sign-up-now-link": "https://users.facilities.rl.ac.uk/auth/CreateAccount.aspx",
    "auto-login-error-msg": "Unable to create anonymous session - please reload the page. If the error persists please contact support"
  },
  "home-page": {
    "title_line1": "<0>Data discovery</0> and <2>access</2>",
    "title_line2": "for <1>large-scale</1> science facilities",
    "browse": {
      "title": "Browse, explore and visualise experimental data",
      "description1": "SciGateway is a ReactJs based parent application within a micro-front end architecture. It provides access to large facilities science.",
      "description2": "The <0>SciGateway</0> application offers features such as authentication and authorisation functionality, notifications, cookies management.",
      "link": "/browse/investigation",
      "button": "Browse data"
    },
    "search": {
      "title": "Search",
      "description": "Search for the experimental data according to different criteria.",
      "link": "/search/data",
      "button": "Search data"
    },
    "download": {
      "title": "Download",
      "description": "Retrieve the experimental data using a variety of download methods.",
      "link": "/download",
      "button": "Download data"
    },
    "facility": {
      "title": "Facility Title",
      "description": "Facility Description",
      "link": "#",
      "button": "Read more"
    }
  },
  "contact-page": {
    "title": "Contact",
    "contact-details-description": "For problems with SciGateway, please contact <a href='mailto:example@email.com?subject=Feedback From SciGateway'>example@email.com</a>"
  },
  "help-page": {
    "title": "Help",
    "table-of-contents": "Table of contents",
    "contents": "<h2 id='logging-in'>Logging in</h2>When you first access TopCAT, you will be presented with a login page.<br><img src='/res/images/login.png'><br>You can login by entering your username and password provided by the <a href='http://www.diamond.ac.uk/Users/'>Diamond User Office</a>. Alternatively, to view only public data, select <strong>Anonymous</strong> from the <strong>Authentication Type</strong> drop down menu and click login.<br><br>Once you've successfully logged in, you will see a page with three tabs.<br><img src='/res/images/tabs.png'><h2 id='my-data'>My Data</h2>The <a href='#'>My Data</a> tab gives you quick access to all your visits and is presented in a grid.<br><img src='/res/images/my-data-grid.png'><br><strong>Meta Data</strong><br>If you click on a row (make sure it is not a hyperlink), tabs will appear on the bottom half of the page. Each tab gives you more information about the visit.<h2 id='browse'>Browse</h2>The <a href='#'>Browse</a> tab allows you to browse your data and any public data.<br><br>The grid works the same as in the My Data tab. You can sort and filter as well as drill drown the data hierarchy using the hyperlinks on each row. You can use the breadcrumb to go up the hierarchy. The breadcrumb is a useful reference to tell you where you are in the data hierarchy.<br><img src='/res/images/breadcrumb.png'><br>If the first column of the grid is a tick box, you can click the box to add the item to your cart. Please note if you select a dataset, all datafiles belonging to that dataset will be selected. It is not possible for example to unselect one datafile if the parent visit is already selected. Similar to My Data, clicking on a row (not hyperlink) will display its meta data information in the panel at the bottom of the page.<h2 id='search'>Search</h2>The search tabs contains an interface the allows you search across all the visits, datasets and datafiles.<h2 id='cart'>The Cart</h2>On the very first column of each row on a grid (at the dataset or datafile level), you will see tick boxes.<br><img src='/res/images/tickbox.png'><br>Clicking this box will add or remove the selected visit to your cart. Multiple items can be added using the 'Shift' key.<br><br>You can use the Cart items counter on the top right corner to check if an item was added or removed.<br><img src='/res/images/cart-button.png'><br>Clicking on the above will open up the cart window:<br><img src='/res/images/cart.png'><br>Here you can remove already added items or request download of the items in the cart by clicking the <strong>Download Cart</strong> button. When the button is clicked, you will be presented with a window with several options.<br><img src='/res/images/cart-download.png'><br>The <strong>Download Name</strong> is a name that identifies your particular download. It is used as the filename when your download becomes ready.<br><br>The <strong>Access Method</strong> selection option determines whether you would like to download your files or whether you want them restored to another location.<br><br>You can optionally enter your email address. When your download is available, an email will be sent notifying you that your download is available.<br>Clicking the <strong>OK</strong> button on the window will submit your download request to be processed. You should see a <strong>Cart successfully submitted</strong> notification popup on the right corner. The request will be added inside the downloads window.<h2 id='download'>Download</h2>Clicking on the above will open up the downloads window:<br><img src='/res/images/downloads-button.png'><br>The Downloads window is a grid that list all your download requests.<br><img src='/res/images/downloads.png'><br>The <strong>Status</strong> column gives you the current status of your download. Possible values are <strong>Restoring from Tape</strong> and <strong>Available</strong>. The <strong>Download</strong> button is disabled when the status is restoring. Once available, you can click the download button to download the file via the browser if <strong>Https</strong> transport type was used for that request.<br><br>Please note that download pausing and resuming is not supported. Multi-part download managers are also not supported.<br><br>For downloads using Globus as the transport type, when the status is complete, you can login to <a href='https://www.globus.org/SignIn'>Globus Online</a> and initiate file transfer to your endpoint."
  },
  "admin": {
    "title": "Admin",
    "scheduled-maintenance-title": "Scheduled Maintenance",
    "scheduled-maintenance-message-arialabel": "Scheduled maintenance message input",
    "scheduled-maintenance-checkbox-arialabel": "Display scheduled maintenance checkbox",
    "maintenance-title": "Maintenance",
    "maintenance-message-arialabel": "Maintenance message input",
    "maintenance-checkbox-arialabel": "Display maintenance checkbox",
    "message-placeholder": "Message",
    "display-checkbox": "Display?",
    "save-button": "Save"
  },
  "cookies-page": {
    "title": "Cookie Policy & Cookie management",
    "cookie-policy-title": "Use of Cookies, Local storage and Session Storage",
    "cookie-policy": "In order to make TopCAT easy and reliable to use, we place small amounts of information on your device. These include small files known as cookies, local storage and session storage. They cannot be used to identify you personally.<br><br>These pieces of information are used to improve services for you, through enabling a service to recognise your device so you don't have to give the same information during one task or over a given time period and recognising that you have already given a username and password so you don't need to enter it for every web page requested.<br><br>You may refuse to accept cookies, local storage and session storage by activating the setting on your browser which allows you to refuse them. Unless you have adjusted your browser setting so that it will refuse cookies, local storage and session storage our system may issue cookies, local storage and session storage when you visit our site.<br><br>For more information on cookies, and how to delete and control them visit <a href='http://www.aboutcookies.org.uk/'>www.aboutcookies.org.uk</a> or <a href='http://www.allaboutcookies.org/'>www.allaboutcookies.org</a>.<br><br>The list below shows all of the cookies, local storage and session storage that are set by TopCAT.",
    "cookie-management-title": "Manage specific cookies",
    "essential-cookies-title": "Essential cookies",
    "essential-cookies-description": "These cookies are essential for the site to function and cannot be opted out of",
    "cookie-consent-description": "cookie-consent cookie - this tells us the preferences you have given to which types of cookies have consented to. It expires after a year",
    "scigateway-token-description": "scigateway:token localStorage item - this tells us your login token so you can authenticate to the site. It does not expire until overriden by a new token or deleted manually.",
    "analytics-cookies-title": "Analytics cookies",
    "analytics-cookies-description": "These cookies help us to deliver a better user experience by telling us how users use the site and the performance of the site as well.",
    "google-analytics-description": "_ga, _gid cookies - Google Analytics. These cookies are used to collect information about how visitors use our website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website and blog, where visitors have come to the website from and the pages they visited.",
    "save-preferences-button": "Save preferences"
  },
  "cookie-consent": {
    "text": "Our website uses cookies to ensure you get the best experience on our website.",
    "link-text": "Learn more",
    "accept-button": "Accept",
    "manage-preferences-button": "Manage Preferences"
  },
  "page-not-found": {
    "title": "Page not found",
    "message": "We're sorry, the page you requested was not found on the server. If you entered the URL manually please check your spelling and try again. Otherwise, return to the <2>homepage</2> or <6>contact support</6>."
  },
  "footer": {
    "links": {
      "text": "<0>ISIS Home</0> | <2>Privacy statement</2> | <4>Data policy</4> | <6>Accessibility statement</6> | <8>Contact</8>",
      "facility": "#",
      "privacy-statement": "#",
      "data-policy": "#",
      "contact": "#"
    },
    "website-development-provider": "Built by the <2>Data and Software Engineering Group</2>"
  },
  "navigation-drawer": {
    "alternative-text": "Science and Technology Facilities Council"
  },
  "accessibility-page": {
    "title": "Accessibility statement for DataGateway",
    "domains-list-text": "This accessibility statement applies to all facilities using DataGateway. This includes:",
    "domains-list": [
      "https://data.isis.stfc.ac.uk "
    ],
    "website-developed-by": "These sites are maintained by the Data Software and Engineering Group, in the Scientific Computing Department. ",
    "how-accessible-this-website-is": "How Accessible This Website Is ",
    "how-accessible-this-website-is-text": "We want as many people as possible to be able to use this website. For example, that means you should be able to: ",
    "accessibile-parts-of-datagateway-list": [
      "listen to most of the website using a screen reader",
      "clearly see all components and text as the contrast has been checked against different types of colour-blindness in normal or high contrast modes (which includes protanopia, protanomaly, deuteranopia, deuteranomaly, tritanopia, tritanomaly, achromatopsia and achromatomaly) ",
      "navigate most of the website using just a keyboard  ",
      "zoom in up to 300% without the text spilling off the screen "
    ],
    "advice-on-how-to-make-device-more-accessible": "<0>AbilityNet</0> has advice on making your device easier to use if you have a disability.",
    "advice-on-how-to-make-device-more-accessible-link": "https://mcmw.abilitynet.org.uk/",
    "non-accessibile-parts-of-datagateway-text": "We know some parts of this website are not fully accessible:",
    "non-accessibile-parts-of-datagateway-list": [
      "the columns on table view cannot be resized using the keyboard",
      "pages sometimes have unreadable ARIA labels",
      "table view has aria hidden elements that contain focusable elements and elements in the table with an ARIA role that required a parent are not contained by them ",
      "nested interactive controls are not announced by screen reader in the sorting in card view ",
      "advanced filters, filters automatically without requiring user input"
    ],
    "contact-us-about-accessibility": "Contact Us About Accessibility",
    "contact-us-about-accessibility-text": "We are always looking to improve the accessibility of this website. If you find any problems not listed on this page or think we are not meeting accessibility requirements, please let us know. You can send us a message to request a more accessible format for content or documents on the site. ",
    "contact-info": "FacilitiesBusinessSystem@stfc.ac.uk",
    "enforcement-procedure": "Enforcement procedure",
    "enforcement-procedure-text": "The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint, <1>contact the Equality Advisory and Support Service (EASS)</1>.",
    "enforcement-procedure-link": "https://www.equalityadvisoryservice.com/",
    "technical-information-about-this-website-accessibility": "Technical information about this website's accessibility",
    "technical-information-about-this-website-accessibility-text": "STFC is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018.",
    "compliance-status": "Compliance Status",
    "compliance-status-text": "This website is partially compliant with the <2>Web Content Accessibility Guidelines version 2.1</2> AA standard, due to the non-compliances and exemptions listed below.",
    "compliance-status-link": "https://www.w3.org/TR/WCAG21/",
    "non-accessible-content": "Non-Accessible Content",
    "non-accessible-content-text": "The content listed below is non-accessible for the following reasons.",
    "non-compliance-with-the-accessibility-regulations": "Non-compliance with the accessibility regulations ",
    "non-compliance-with-the-accessibility-regulations-list": [
      "Some of the pages have unreadable ARIA labels. This fails WCAG 2.1 success criterion 4.1.2 (A): Name, Role, and Value",
      "The advanced filters, filters automatically without requiring user input. This fails WCAG 2.1 success criterion 3.2.2 On Input"
    ],
    "non-compliance-with-the-accessibility-regulations-text": "We will make sure that all the non-compliances above are addressed before the next release, likely to be in September 2022.",
    "disproportionate-burden": {
      "title": "Disproportionate burden",
      "table-view": "Table view",
      "table-view-list": [
        "There is no way to have ARIA hidden elements that do not contain focusable elements in the text field of the filters",
        "It is not possible for elements in the table with an ARIA role that requires a parent to be contained by them ",
        "There is no way the columns on table view cannot be resized using the keyboard"
      ],
      "card-view": "Card view",
      "card-view-list": [
        "It is not possible to announce the nested interactive controls using a screen reader for the sorting "
      ],
      "text": "We have assessed the time it would take to resolve these issues with table view, and card view. We believe that doing so now would be a <2>disproportionate burden</2> within the meaning of the accessibility regulations. We will make another assessment before the next release, likely to be in September 2022.",
      "link": "https://www.legislation.gov.uk/uksi/2018/952/regulation/7/made"
    },
    "preparation-of-this-accessibility-statement": "Preparation of this accessibility statement ",
    "preparation-of-this-accessibility-statement-text": "This statement was prepared on the <2>14th of February 2022</2>. It was last reviewed on the <5>11th of March 2022</5>. This website was last tested on <9>30th of November 2021</9>. The test was carried out by the <12>Data & Software Engineering Group</12>."
  }
}